Catalogs/СтруктураЦелей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктураЦелей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОценкиПоказателяЭффективности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницыШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыГраницыШкалыПоказателяЭффективности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратнаяШкала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяВводПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суммируемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВМатрицеТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаЗадаетсяИнтервалом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалОценкиОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалОценкиДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыГраницыШкалыПоказателяЭффективности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыГраницыШкалыПоказателяЭффективности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФактическоеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтношениеФактическогоКПлановому</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтношениеПлановогоКФактическому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтруктураЦелей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.СтруктураЦелей";
	КомандаПечати.Идентификатор = "ПоказательЭффективности";
	КомандаПечати.Представление = ?(КомандыПечати.Количество() > 1, НСтр("ru = 'Показатель эффективности'"), НСтр("ru = 'Печать'"));
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Показатель эффективности'");
	КомандаПечати.Порядок = 1;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Процедура - Формирует печатные формы
//
// Параметры:
//  МассивОбъектов			 - Массив - ссылки на объекты, которые нужно распечатать
//  ПараметрыПечати			 - Структура - дополнительные настройки печати
//  КоллекцияПечатныхФорм	 - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати			 - СписокЗначений - значение - ссылка на объект
//  ПараметрыВывода			 - Структура - дополнительные параметры сформированных табличных документов (выходной параметр)
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПоказательЭффективности") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПоказательЭффективности",
			НСтр("ru = 'Показатель эффективности'"),
		ПечатьПоказателяЭффективности(МассивОбъектов, ОбъектыПечати),,"Справочник.СтруктураЦелей.ПФ_MXL_ПоказательЭффективности");
	КонецЕсли;
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьПолноеНаименование");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Функция - Печать показателя эффективности
// Параметры:
//  МассивОбъектов	 - Массив - массив типа СправочникСсылка.ПрофилиДолжностей
//  ОбъектыПечати	 - СписокЗначений - список доступных значений
// 
// Возвращаемое значение:
//  ТабличныйДокумент - табличный документ с областями макета
//
Функция ПечатьПоказателяЭффективности(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПоказательЭффективности";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.СтруктураЦелей.ПФ_MXL_ПоказательЭффективности");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШкалаЗначенийШапка = Макет.ПолучитьОбласть("ШкалаЗначенийШапка");
	ОбластьШкалаЗначений = Макет.ПолучитьОбласть("ШкалаЗначений");
	ОбластьШапкаГрафика = Макет.ПолучитьОбласть("ШапкаГрафика");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|	КОГДА СтруктураЦелей.ГраницыШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыГраницыШкалыПоказателяЭффективности.ФактическоеЗначение)
	|		ТОГДА &ТекстФактическоеЗначение
	|	ИНАЧЕ ВЫБОР
	|			КОГДА СтруктураЦелей.ГраницыШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыГраницыШкалыПоказателяЭффективности.ОтношениеФактическогоКПлановому)
	|				ТОГДА &ТекстСоотношенияФактаКПлану
	|			ИНАЧЕ ВЫБОР
	|					КОГДА СтруктураЦелей.ГраницыШкалы = ЗНАЧЕНИЕ(Перечисление.ТипыГраницыШкалыПоказателяЭффективности.ОтношениеПлановогоКФактическому)
	|						ТОГДА &ТекстСоотношенияПланакФакту
	|				КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК ГраницыШкалы,
	|	СтруктураЦелей.Родитель.Представление КАК Родитель,
	|	СтруктураЦелей.Наименование КАК Наименование,
	|	СтруктураЦелей.ПолноеНаименование КАК ПолноеНаименование,
	|	СтруктураЦелей.ОбратнаяШкала КАК ОбратнаяШкала,
	|	СтруктураЦелей.Описание КАК Описание,
	|	СтруктураЦелей.СпособОценки КАК СпособОценки,
	|	ВЫБОР
	|		КОГДА СтруктураЦелей.Суммируемый
	|			ТОГДА &ТекстПоОтдельнымЗначениям
	|		ИНАЧЕ &ТекстЕдиновременно
	|	КОНЕЦ КАК Суммируемый,
	|	СтруктураЦелей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктураЦелей КАК СтруктураЦелей
	|ГДЕ
	|	СтруктураЦелей.Ссылка В ИЕРАРХИИ(&ПоказателиЭффективности)
	|	И НЕ СтруктураЦелей.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтруктураЦелейШкалаЗначений.Ссылка КАК Ссылка,
	|	СтруктураЦелейШкалаЗначений.НомерСтроки КАК НомерСтроки,
	|	0 КАК ЗначениеОт,
	|	СтруктураЦелейШкалаЗначений.ЗначениеДо КАК ЗначениеДо,
	|	СтруктураЦелейШкалаЗначений.Оценка КАК Оценка,
	|	СтруктураЦелейШкалаЗначений.ОценкаЗадаетсяИнтервалом КАК ОценкаЗадаетсяИнтервалом,
	|	СтруктураЦелейШкалаЗначений.ИнтервалОценкиОт КАК ИнтервалОценкиОт,
	|	СтруктураЦелейШкалаЗначений.ИнтервалОценкиДо КАК ИнтервалОценкиДо,
	|	ВЫБОР
	|		КОГДА НЕ СтруктураЦелейШкалаЗначений.ОценкаЗадаетсяИнтервалом
	|			ТОГДА СтруктураЦелейШкалаЗначений.Оценка
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СтруктураЦелейШкалаЗначений.ОценкаЗадаетсяИнтервалом
	|					ТОГДА &ТекстОт + СТРОКА(СтруктураЦелейШкалаЗначений.ИнтервалОценкиОт) + &ТекстДо + СТРОКА(СтруктураЦелейШкалаЗначений.ИнтервалОценкиДо)
	|			КОНЕЦ
	|	КОНЕЦ КАК ОценкаПредставление,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК ЗначениеПредставление
	|ИЗ
	|	Справочник.СтруктураЦелей.ШкалаЗначений КАК СтруктураЦелейШкалаЗначений
	|ГДЕ
	|	СтруктураЦелейШкалаЗначений.Ссылка В ИЕРАРХИИ(&ПоказателиЭффективности)
	|	И НЕ СтруктураЦелейШкалаЗначений.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.Параметры.Вставить("ПоказателиЭффективности", МассивОбъектов);
	Запрос.УстановитьПараметр("ТекстФактическоеЗначение", НСтр("ru='Фактическим значением показателя'"));
	Запрос.УстановитьПараметр("ТекстСоотношенияФактаКПлану", НСтр("ru='Процентным соотношением фактического и планового значений показателя'"));
	Запрос.УстановитьПараметр("ТекстСоотношенияПланаКФакту", НСтр("ru='Процентным соотношением планового и фактического значений показателя'"));
	Запрос.УстановитьПараметр("ТекстПоОтдельнымЗначениям",НСтр("ru='Накапливается по отдельным значениям введеных документов в периоде'"));
	Запрос.УстановитьПараметр("ТекстЕдиновременно", НСтр("ru='Вводится единовременно в периоде оценки (например раз в месяц)'"));
	Запрос.УстановитьПараметр("ТекстОт", СтрШаблон(НСтр("ru = 'от%1'"), " "));
	Запрос.УстановитьПараметр("ТекстДо", СтрШаблон(НСтр("ru = '%1до%2'"), " ", " "));
	
	Результаты = Запрос.ВыполнитьПакет();
	ВыборкаПоПоказателям = Результаты.Получить(0).Выбрать();
	ТаблицаШкалЗначений = Результаты.Получить(1).Выгрузить();
	
	ТабличныйДокумент.Очистить();
	ПервыйДокумент = Истина;
	Пока ВыборкаПоПоказателям.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаПоПоказателям);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ОбластьШапка.Параметры.Заполнить(ВыборкаПоПоказателям);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбратнаяШкала = ВыборкаПоПоказателям.ОбратнаяШкала;
		
		СтруктураОтбора = Новый Структура("Ссылка",ВыборкаПоПоказателям.Ссылка);
		МассивСтрокШкалыЗначений = ТаблицаШкалЗначений.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрокШкалыЗначений.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШкалаЗначенийШапка);
		ОбластьГрафик= Макет.ПолучитьОбласть("График");
		Диаграмма = ОбластьГрафик.Рисунки.D1.Объект;
		Диаграмма.ИсточникДанных = Неопределено;
		Диаграмма.Автотранспонирование = Ложь;
		Диаграмма.ОтображатьЛегенду = Ложь;
		НазваниеСерии = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Оценка по результатам%1эффективности'"), Символы.ПС);
		Серия = Диаграмма.Серии.Добавить(НазваниеСерии);
		Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, 3);
		КлючевыеПоказателиЭффективностиКлиентСервер.УстановитьПредставлениеИнтервалаПоНижнейГранице(
			МассивСтрокШкалыЗначений,
			ВыборкаПоПоказателям.ОбратнаяШкала,
			Истина);
		МаксЗначениеДо = 0;
		МаксимальнаяОценка = 0;
		
		Для Каждого Строка Из МассивСтрокШкалыЗначений Цикл
			ОбластьШкалаЗначений.Параметры.Заполнить(Строка);
			ТабличныйДокумент.Вывести(ОбластьШкалаЗначений);
			ТекущийИндекс = КлючевыеПоказателиЭффективностиКлиентСервер.ИндексСтрокиКоллекции(
			МассивСтрокШкалыЗначений, Строка);
			Если Строка.ОценкаЗадаетсяИнтервалом Тогда
				Координаты = СформироватьМассивКоординат(Строка.ЗначениеОт, Строка.ИнтервалОценкиОт,
					Строка.ЗначениеДо, Строка.ИнтервалОценкиДо);
				ДобавитьТочкиНаГрафик(Диаграмма, Серия, Координаты);
			Иначе
				Если Строка.ЗначениеДо = КлючевыеПоказателиЭффективностиКлиентСервер.ЗначениеПоследнегоПорогаШкалы(ОбратнаяШкала) Тогда
					Если ОбратнаяШкала Тогда
						ЗначениеДо = Строка.ЗначениеОт;
						УстановитьИнтервалЗначенийОтДо(Строка, МаксЗначениеДо, ЗначениеДо);
					Иначе
						УстановитьИнтервалЗначенийОтДо(Строка, МаксЗначениеДо, МаксЗначениеДо * КоэффициентШкалыПоВозрастанию());
					КонецЕсли;
				КонецЕсли;
				Если ТекущийИндекс = 0
					И ОбратнаяШкала
					И МассивСтрокШкалыЗначений.Количество() <> 1 Тогда
					Строка.ЗначениеОт = Строка.ЗначениеДо * КоэффициентШкалыПоУбыванию();
				КонецЕсли;
				Координаты = СформироватьМассивКоординат(Строка.ЗначениеОт,Строка.Оценка,Строка.ЗначениеДо,Строка.Оценка);
				ДобавитьТочкиНаГрафик(Диаграмма, Серия, Координаты);
			КонецЕсли;
			МаксЗначениеДо = Строка.ЗначениеДо;
			МаксимальнаяОценка = Макс(МаксимальнаяОценка, Строка.Оценка);
		КонецЦикла;
		
		Диаграмма.ОсьЗначений.МаксимальноеЗначение = МаксимальнаяОценка + 1;
		Диаграмма.Обновление = Истина;
		
		ТабличныйДокумент.Вывести(ОбластьШапкаГрафика);
		ТабличныйДокумент.Вывести(ОбластьГрафик);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоПоказателям.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

Функция КоэффициентШкалыПоВозрастанию()

	Возврат 1.2;

КонецФункции

Функция КоэффициентШкалыПоУбыванию()

	Возврат 1.5;

КонецФункции

Функция СформироватьМассивКоординат(X1, Y1, X2, Y2)

	Координаты = Новый Массив(2,2);
	
	Координаты[0][0]  = X1;
	Координаты[0][1]  = Y1;
	Координаты[1][0]  = X2;
	Координаты[1][1]  = Y2;
	
	Возврат Координаты;

КонецФункции

Процедура УстановитьИнтервалЗначенийОтДо(Строка, ЗначениеОт, ЗначениеДо)
	
		Строка.ЗначениеОт = ЗначениеОт;
		Строка.ЗначениеДо = ЗначениеДо;
	
КонецПроцедуры

Процедура ДобавитьТочкиНаГрафик(График, Серия, Координаты)
	
	Для Индекс = 0 По Координаты.Количество() - 1 Цикл
	
		КоординатыТочки = Координаты[Индекс];
		Точка = График.Точки.Добавить(Строка(КоординатыТочки[0]));// Координата X
		График.УстановитьЗначение(Точка, Серия, КоординатыТочки[1]); // Координата Y
	
	КонецЦикла;
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьПолноеНаименование(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	СтруктураЦелей.Ссылка КАК Ссылка,
	|	СтруктураЦелей.УдалитьКраткоеНаименование КАК ПолноеНаименование
	|ИЗ
	|	Справочник.СтруктураЦелей КАК СтруктураЦелей
	|ГДЕ
	|	(ВЫРАЗИТЬ(СтруктураЦелей.ПолноеНаименование КАК СТРОКА(1000))) = """"
	|			И СтруктураЦелей.УдалитьКраткоеНаименование <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Справочник.СтруктураЦелей", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ПолноеНаименование = Выборка.ПолноеНаименование;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
